In [1]:
import pandas as pd

In [2]:
employees = pd.read_csv('data/employees.csv')

In [3]:
employees

   id       name  title_id  years  department_id
0   2      chris         1     15              2
1   6      sandy         2      5              7
2   7  christine         1      5              4
3  12      aaron         3      3              3

In [4]:
employees = employees.set_index('id')

In [5]:
employees

         name  title_id  years  department_id
id
2       chris         1     15              2
6       sandy         2      5              7
7   christine         1      5              4
12      aaron         3      3              3

In [6]:
titles = pd.read_csv('data/titles.csv', index_col=0)

In [7]:
titles

             name
id
1       President
2   Lead Engineer
3          Intern

In [8]:
employees.join(titles, rsuffix='_title')

         name  title_id  years  department_id     name_title
id
2       chris         1     15              2  Lead Engineer
6       sandy         2      5              7            NaN
7   christine         1      5              4            NaN
12      aaron         3      3              3            NaN

In [9]:
employees.join(titles, on=['title_id'], rsuffix='_title')

         name  title_id  years  department_id     name_title
id
2       chris         1     15              2      President
6       sandy         2      5              7  Lead Engineer
7   christine         1      5              4      President
12      aaron         3      3              3         Intern

In [10]:
empl_with_title = employees.join(titles, on=['title_id'], rsuffix='_title')

In [11]:
departments = pd.read_csv('data/departments.csv', index_col=0)

In [12]:
departments

                 name
id
1               sales
2             product
3   technical support
4     human resources

In [13]:
empl_with_title.join(departments, on=['department_id'], rsuffix='_dept')

,name,title_id,years,department_id,name_title,name_dept
id,,,,,,
2,chris,1,15,2,President,product
6,sandy,2,5,7,Lead Engineer,NaN
7,christine,1,5,4,President,human resources
12,aaron,3,3,3,Intern,technical support

In [14]:
empl_with_title.join(departments, on=['department_id'], how='inner', rsuffix='_dept')

         name  title_id  years  department_id name_title          name_dept
id
2       chris         1     15              2  President            product
7   christine         1      5              4  President    human resources
12      aaron         3      3              3     Intern  technical support

In [15]:
empl_with_title.join(departments, on=['department_id'], how='right', rsuffix='_dept')

         name  title_id  years  department_id name_title          name_dept
id
2       chris       1.0   15.0            2.0  President            product
7   christine       1.0    5.0            4.0  President    human resources
12      aaron       3.0    3.0            3.0     Intern  technical support
12        NaN       NaN    NaN            1.0        NaN              sales